MCUdude/MegaCoreX/megaavr/boards.txt
1609.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
1609.menu.bootloader.uart2_alternative.upload.maximum_size=15872
1609.menu.bootloader.uart2_alternative.upload.protocol=arduino
1609.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
1609.menu.bootloader.uart2_alternative.upload.extra_params=
1609.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
1609.menu.bootloader.uart2_alternative.build.export_merged_output=true
1609.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1609.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
1609.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1609.menu.bootloader.uart3_default=Optiboot (UART3 default pins)
1609.menu.bootloader.uart3_default.upload.maximum_size=15872
1609.menu.bootloader.uart3_default.upload.protocol=arduino
1609.menu.bootloader.uart3_default.upload.port=UART3_DEF
1609.menu.bootloader.uart3_default.upload.extra_params=
1609.menu.bootloader.uart3_default.build.text_section_start=.text=0x200
1609.menu.bootloader.uart3_default.build.export_merged_output=true
1609.menu.bootloader.uart3_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1609.menu.bootloader.uart3_default.bootloader.BOOTEND=0x02
1609.menu.bootloader.uart3_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1609.menu.bootloader.uart3_alternative=Optiboot (UART3 alternative pins)
1609.menu.bootloader.uart3_alternative.upload.maximum_size=15872
1609.menu.bootloader.uart3_alternative.upload.protocol=arduino
1609.menu.bootloader.uart3_alternative.upload.port=UART3_ALT
1609.menu.bootloader.uart3_alternative.upload.extra_params=
1609.menu.bootloader.uart3_alternative.build.text_section_start=.text=0x200
1609.menu.bootloader.uart3_alternative.build.export_merged_output=true
1609.menu.bootloader.uart3_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1609.menu.bootloader.uart3_alternative.bootloader.BOOTEND=0x02
1609.menu.bootloader.uart3_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}


####################
#### ATmega1608 ####
####################

# General
1608.name=ATmega1608
1608.upload.tool=avrdude
1608.upload.maximum_data_size=2048
1608.upload.speed=115200
1608.bootloader.tool=avrdude
1608.build.core=coreX-corefiles
1608.build.board=AVR_ATmega1608
1608.build.mcu=atmega1608
1608.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
1608.bootloader.WDTCFG=0x00
1608.bootloader.TCD0CFG=0x00
1608.bootloader.SYSCFG1=0x06
1608.bootloader.APPEND=0x00
1608.bootloader.LOCKBIT=0xC5

# Pinouts
1608.menu.pinout.32pin_standard=32 pin standard
1608.menu.pinout.32pin_standard.build.variant=32pin-standard
1608.menu.pinout.28pin_standard=28 pin standard
1608.menu.pinout.28pin_standard.build.variant=28pin-standard

# EEPROM
1608.menu.eeprom.keep=EEPROM retained
1608.menu.eeprom.keep.bootloader.eesave_bit=1
1608.menu.eeprom.erase=EEPROM not retained
1608.menu.eeprom.erase.bootloader.eesave_bit=0

# Reset pin
1608.menu.resetpin.reset=Reset
1608.menu.resetpin.reset.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}
1608.menu.resetpin.gpio=GPIO
1608.menu.resetpin.gpio.bootloader.SYSCFG0=0b1100000{bootloader.eesave_bit}

# Brown out detection
1608.menu.BOD.2v6=BOD 2.6V
1608.menu.BOD.2v6.bootloader.BODCFG=0x54
1608.menu.BOD.4v3=BOD 4.3V
1608.menu.BOD.4v3.bootloader.BODCFG=0xF4
1608.menu.BOD.4v0=BOD 4.0V
1608.menu.BOD.4v0.bootloader.BODCFG=0xD4
1608.menu.BOD.3v7=BOD 3.7V
1608.menu.BOD.3v7.bootloader.BODCFG=0xB4
1608.menu.BOD.3v3=BOD 3.3V
1608.menu.BOD.3v3.bootloader.BODCFG=0x94
1608.menu.BOD.2v9=BOD 2.9V
1608.menu.BOD.2v9.bootloader.BODCFG=0x74
1608.menu.BOD.2v1=BOD 2.1V
1608.menu.BOD.2v1.bootloader.BODCFG=0x34
1608.menu.BOD.1v8=BOD 1.8V
1608.menu.BOD.1v8.bootloader.BODCFG=0x14
1608.menu.BOD.disabled=BOD disabled
1608.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
1608.menu.clock.internal_16MHz=Internal 16 MHz
1608.menu.clock.internal_16MHz.upload.speed=115200
1608.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_16MHz.build.oscillator=
1608.menu.clock.internal_16MHz.build.f_cpu=16000000L

1608.menu.clock.internal_20MHz=Internal 20 MHz
1608.menu.clock.internal_20MHz.upload.speed=115200
1608.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
1608.menu.clock.internal_20MHz.build.oscillator=
1608.menu.clock.internal_20MHz.build.f_cpu=20000000L

1608.menu.clock.internal_10MHz=Internal 10 MHz
1608.menu.clock.internal_10MHz.upload.speed=115200
1608.menu.clock.internal_10MHz.bootloader.OSCCFG=0x02
1608.menu.clock.internal_10MHz.build.oscillator=
1608.menu.clock.internal_10MHz.build.f_cpu=10000000L

1608.menu.clock.internal_8MHz=Internal 8 MHz
1608.menu.clock.internal_8MHz.upload.speed=115200
1608.menu.clock.internal_8MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_8MHz.build.oscillator=
1608.menu.clock.internal_8MHz.build.f_cpu=8000000L

1608.menu.clock.internal_5MHz=Internal 5 MHz
1608.menu.clock.internal_5MHz.upload.speed=115200
1608.menu.clock.internal_5MHz.bootloader.OSCCFG=0x02
1608.menu.clock.internal_5MHz.build.oscillator=
1608.menu.clock.internal_5MHz.build.f_cpu=5000000L

1608.menu.clock.internal_4MHz=Internal 4 MHz
1608.menu.clock.internal_4MHz.upload.speed=115200
1608.menu.clock.internal_4MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_4MHz.build.oscillator=
1608.menu.clock.internal_4MHz.build.f_cpu=4000000L

1608.menu.clock.internal_2MHz=Internal 2 MHz
1608.menu.clock.internal_2MHz.upload.speed=115200
1608.menu.clock.internal_2MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_2MHz.build.oscillator=
1608.menu.clock.internal_2MHz.build.f_cpu=2000000L

1608.menu.clock.internal_1MHz=Internal 1 MHz
1608.menu.clock.internal_1MHz.upload.speed=115200
1608.menu.clock.internal_1MHz.bootloader.OSCCFG=0x01
1608.menu.clock.internal_1MHz.build.oscillator=
1608.menu.clock.internal_1MHz.build.f_cpu=1000000L

1608.menu.clock.external_16MHz=External 16 MHz
1608.menu.clock.external_16MHz.upload.speed=115200
1608.menu.clock.external_16MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_16MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_16MHz.build.f_cpu=16000000L

