MCUdude/MegaCoreX/megaavr/boards.txt
1608.menu.clock.external_12MHz=External 12 MHz
1608.menu.clock.external_12MHz.upload.speed=115200
1608.menu.clock.external_12MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_12MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_12MHz.build.f_cpu=12000000L

1608.menu.clock.external_8MHz=External 8 MHz
1608.menu.clock.external_8MHz.upload.speed=115200
1608.menu.clock.external_8MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_8MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_8MHz.build.f_cpu=8000000L

1608.menu.clock.external_4MHz=External 4 MHz
1608.menu.clock.external_4MHz.upload.speed=115200
1608.menu.clock.external_4MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_4MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_4MHz.build.f_cpu=4000000L

1608.menu.clock.external_1MHz=External 1 MHz
1608.menu.clock.external_1MHz.upload.speed=115200
1608.menu.clock.external_1MHz.bootloader.OSCCFG=0x01
1608.menu.clock.external_1MHz.build.oscillator=-DUSE_EXTERNAL_OSCILLATOR
1608.menu.clock.external_1MHz.build.f_cpu=1000000L

# Bootloader
1608.menu.bootloader.no_bootloader=No bootloader
1608.menu.bootloader.no_bootloader.upload.maximum_size=16384
1608.menu.bootloader.no_bootloader.upload.extra_params=
1608.menu.bootloader.no_bootloader.build.text_section_start=.text=0x0
1608.menu.bootloader.no_bootloader.build.export_merged_output=false
1608.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex
1608.menu.bootloader.no_bootloader.bootloader.BOOTEND=0x00

1608.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
1608.menu.bootloader.uart0_default.upload.maximum_size=15872
1608.menu.bootloader.uart0_default.upload.protocol=arduino
1608.menu.bootloader.uart0_default.upload.port=UART0_DEF
1608.menu.bootloader.uart0_default.upload.extra_params=
1608.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
1608.menu.bootloader.uart0_default.build.export_merged_output=true
1608.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart0_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1608.menu.bootloader.uart0_alternative=Optiboot (UART0 alternative pins)
1608.menu.bootloader.uart0_alternative.upload.maximum_size=15872
1608.menu.bootloader.uart0_alternative.upload.protocol=arduino
1608.menu.bootloader.uart0_alternative.upload.port=UART0_ALT
1608.menu.bootloader.uart0_alternative.upload.extra_params=
1608.menu.bootloader.uart0_alternative.build.text_section_start=.text=0x200
1608.menu.bootloader.uart0_alternative.build.export_merged_output=true
1608.menu.bootloader.uart0_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart0_alternative.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart0_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1608.menu.bootloader.uart1_default=Optiboot (UART1 default pins)
1608.menu.bootloader.uart1_default.upload.maximum_size=15872
1608.menu.bootloader.uart1_default.upload.protocol=arduino
1608.menu.bootloader.uart1_default.upload.port=UART1_DEF
1608.menu.bootloader.uart1_default.upload.extra_params=
1608.menu.bootloader.uart1_default.build.text_section_start=.text=0x200
1608.menu.bootloader.uart1_default.build.export_merged_output=true
1608.menu.bootloader.uart1_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart1_default.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart1_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1608.menu.bootloader.uart1_alternative=Optiboot (UART1 alternative pins)
1608.menu.bootloader.uart1_alternative.upload.maximum_size=15872
1608.menu.bootloader.uart1_alternative.upload.protocol=arduino
1608.menu.bootloader.uart1_alternative.upload.port=UART1_ALT
1608.menu.bootloader.uart1_alternative.upload.extra_params=
1608.menu.bootloader.uart1_alternative.build.text_section_start=.text=0x200
1608.menu.bootloader.uart1_alternative.build.export_merged_output=true
1608.menu.bootloader.uart1_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart1_alternative.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart1_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1608.menu.bootloader.uart2_default=Optiboot (UART2 default pins)
1608.menu.bootloader.uart2_default.upload.maximum_size=15872
1608.menu.bootloader.uart2_default.upload.protocol=arduino
1608.menu.bootloader.uart2_default.upload.port=UART2_DEF
1608.menu.bootloader.uart2_default.upload.extra_params=
1608.menu.bootloader.uart2_default.build.text_section_start=.text=0x200
1608.menu.bootloader.uart2_default.build.export_merged_output=true
1608.menu.bootloader.uart2_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart2_default.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart2_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}

1608.menu.bootloader.uart2_alternative=Optiboot (UART2 alternative pins)
1608.menu.bootloader.uart2_alternative.upload.maximum_size=15872
1608.menu.bootloader.uart2_alternative.upload.protocol=arduino
1608.menu.bootloader.uart2_alternative.upload.port=UART2_ALT
1608.menu.bootloader.uart2_alternative.upload.extra_params=
1608.menu.bootloader.uart2_alternative.build.text_section_start=.text=0x200
1608.menu.bootloader.uart2_alternative.build.export_merged_output=true
1608.menu.bootloader.uart2_alternative.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
1608.menu.bootloader.uart2_alternative.bootloader.BOOTEND=0x02
1608.menu.bootloader.uart2_alternative.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}


###################
#### ATmega809 ####
###################

# General
809.name=ATmega809
809.upload.tool=avrdude
809.upload.maximum_data_size=1024
809.upload.speed=115200
809.bootloader.tool=avrdude
809.build.core=coreX-corefiles
809.build.board=AVR_ATmega809
809.build.mcu=atmega809
809.build.extra_flags={build.oscillator} {build.compat}

# Fuses we don't need to modify in the tools menu
809.bootloader.WDTCFG=0x00
809.bootloader.TCD0CFG=0x00
809.bootloader.SYSCFG1=0x06
809.bootloader.APPEND=0x00
809.bootloader.LOCKBIT=0xC5

# Pinouts
809.menu.pinout.48pin_standard=48 pin standard
809.menu.pinout.48pin_standard.build.variant=48pin-standard
809.menu.pinout.48pin_standard.build.compat=
809.menu.pinout.uno_wifi=Uno WiFi
809.menu.pinout.uno_wifi.build.variant=uno-wifi
809.menu.pinout.uno_wifi.build.compat=

# EEPROM
809.menu.eeprom.keep=EEPROM retained
809.menu.eeprom.keep.bootloader.eesave_bit=1
809.menu.eeprom.erase=EEPROM not retained
809.menu.eeprom.erase.bootloader.eesave_bit=0

# Reset pin
809.menu.resetpin.reset=Reset
809.menu.resetpin.reset.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}
809.menu.resetpin.gpio=GPIO
809.menu.resetpin.gpio.bootloader.SYSCFG0=0b1100000{bootloader.eesave_bit}

# Brown out detection
809.menu.BOD.2v6=BOD 2.6V
809.menu.BOD.2v6.bootloader.BODCFG=0x54
809.menu.BOD.4v3=BOD 4.3V
809.menu.BOD.4v3.bootloader.BODCFG=0xF4
809.menu.BOD.4v0=BOD 4.0V
809.menu.BOD.4v0.bootloader.BODCFG=0xD4
809.menu.BOD.3v7=BOD 3.7V
809.menu.BOD.3v7.bootloader.BODCFG=0xB4
809.menu.BOD.3v3=BOD 3.3V
809.menu.BOD.3v3.bootloader.BODCFG=0x94
809.menu.BOD.2v9=BOD 2.9V
809.menu.BOD.2v9.bootloader.BODCFG=0x74
809.menu.BOD.2v1=BOD 2.1V
809.menu.BOD.2v1.bootloader.BODCFG=0x34
809.menu.BOD.1v8=BOD 1.8V
809.menu.BOD.1v8.bootloader.BODCFG=0x14
809.menu.BOD.disabled=BOD disabled
809.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
809.menu.clock.internal_16MHz=Internal 16 MHz
809.menu.clock.internal_16MHz.upload.speed=115200
809.menu.clock.internal_16MHz.bootloader.OSCCFG=0x01
809.menu.clock.internal_16MHz.build.oscillator=
809.menu.clock.internal_16MHz.build.f_cpu=16000000L

809.menu.clock.internal_20MHz=Internal 20 MHz
809.menu.clock.internal_20MHz.upload.speed=115200
809.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
809.menu.clock.internal_20MHz.build.oscillator=
809.menu.clock.internal_20MHz.build.f_cpu=20000000L

